; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v8 ?v11)
             (pred_12 ?v7 ?v10)
             (pred_3 ?v8 ?v10)
             (pred_9 ?v1 ?v8 )
	     (pred_5 ?v8)
             (pred_1 ?v13)
             (pred_8 ?v7)
             (pred_6 ?v10)
             (pred_2 ?v8)
             (pred_11 ?v7)
             (pred_10 ?v8)
             (pred_7 ))



(:action op_5
:parameters (?v6 ?v5 ?v12 ?v3)
:precondition (and (pred_1 ?v6) (pred_1 ?v5) (pred_8 ?v12) (pred_6 ?v3)
          (pred_4 ?v6 ?v5) (pred_12 ?v12 ?v3)
                   (pred_3 ?v5 ?v3) (pred_5 ?v6) 
                   (pred_2 ?v5) (pred_11 ?v12))
:effect (and  (pred_10 ?v5) (not (pred_2 ?v5))))


(:action op_1
:parameters (?v6 ?v2)
:precondition (and (pred_1 ?v6) (pred_1 ?v2)
               (pred_5 ?v6) (pred_4 ?v6 ?v2) (pred_10 ?v2))
:effect (and (pred_5 ?v2) (not (pred_5 ?v6))))

(:action op_2
:parameters (?v6 ?v12)
:precondition (and (pred_1 ?v6) (pred_8 ?v12) 
                  (pred_5 ?v6) (pred_9 ?v12 ?v6) (pred_7 ))
:effect (and (pred_11 ?v12)
   (not (pred_9 ?v12 ?v6)) (not (pred_7 ))))


(:action op_3
:parameters (?v6 ?v9 ?v4)
:precondition (and (pred_1 ?v6) (pred_8 ?v9) (pred_8 ?v4)
                  (pred_5 ?v6) (pred_11 ?v4) (pred_9 ?v9 ?v6))
:effect (and (pred_11 ?v9) (pred_9 ?v4 ?v6)
        (not (pred_11 ?v4)) (not (pred_9 ?v9 ?v6))))

(:action op_4
:parameters (?v6 ?v12)
:precondition (and (pred_1 ?v6) (pred_8 ?v12) 
                  (pred_5 ?v6) (pred_11 ?v12))
:effect (and (pred_7 ) (pred_9 ?v12 ?v6) (not (pred_11 ?v12)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_07 obj_11 obj_14 obj_30 obj_12 obj_10 obj_27 obj_29 obj_09 obj_20 obj_08 obj_21 obj_26 obj_24 obj_31 obj_03 obj_05 obj_18 obj_22 obj_28 obj_23 obj_19 obj_04 obj_15 obj_02
    obj_13 obj_16 obj_06
    obj_32 obj_25 obj_17 obj_01
    )

    (:init
       (pred_7)

       (pred_1 obj_07)
       (pred_1 obj_11)
       (pred_1 obj_14)
       (pred_1 obj_30)
       (pred_1 obj_12)
       (pred_1 obj_10)
       (pred_1 obj_27)
       (pred_1 obj_29)
       (pred_1 obj_09)
       (pred_1 obj_20)
       (pred_1 obj_08)
       (pred_1 obj_21)
       (pred_1 obj_26)
       (pred_1 obj_24)
       (pred_1 obj_31)
       (pred_1 obj_03)
       (pred_1 obj_05)
       (pred_1 obj_18)
       (pred_1 obj_22)
       (pred_1 obj_28)
       (pred_1 obj_23)
       (pred_1 obj_19)
       (pred_1 obj_04)
       (pred_1 obj_15)
       (pred_1 obj_02)
       (pred_6 obj_13)
       (pred_6 obj_16)
       (pred_6 obj_06)
       (pred_8 obj_32)
       (pred_8 obj_25)
       (pred_8 obj_17)
       (pred_8 obj_01)

       (pred_4 obj_07 obj_10)
       (pred_4 obj_07 obj_11)
       (pred_4 obj_11 obj_27)
       (pred_4 obj_11 obj_14)
       (pred_4 obj_11 obj_07)
       (pred_4 obj_14 obj_29)
       (pred_4 obj_14 obj_30)
       (pred_4 obj_14 obj_11)
       (pred_4 obj_30 obj_09)
       (pred_4 obj_30 obj_12)
       (pred_4 obj_30 obj_14)
       (pred_4 obj_12 obj_20)
       (pred_4 obj_12 obj_30)
       (pred_4 obj_10 obj_08)
       (pred_4 obj_10 obj_27)
       (pred_4 obj_10 obj_07)
       (pred_4 obj_27 obj_21)
       (pred_4 obj_27 obj_29)
       (pred_4 obj_27 obj_11)
       (pred_4 obj_27 obj_10)
       (pred_4 obj_29 obj_26)
       (pred_4 obj_29 obj_09)
       (pred_4 obj_29 obj_14)
       (pred_4 obj_29 obj_27)
       (pred_4 obj_09 obj_24)
       (pred_4 obj_09 obj_20)
       (pred_4 obj_09 obj_30)
       (pred_4 obj_09 obj_29)
       (pred_4 obj_20 obj_31)
       (pred_4 obj_20 obj_12)
       (pred_4 obj_20 obj_09)
       (pred_4 obj_08 obj_03)
       (pred_4 obj_08 obj_21)
       (pred_4 obj_08 obj_10)
       (pred_4 obj_21 obj_05)
       (pred_4 obj_21 obj_26)
       (pred_4 obj_21 obj_27)
       (pred_4 obj_21 obj_08)
       (pred_4 obj_26 obj_18)
       (pred_4 obj_26 obj_24)
       (pred_4 obj_26 obj_29)
       (pred_4 obj_26 obj_21)
       (pred_4 obj_24 obj_22)
       (pred_4 obj_24 obj_31)
       (pred_4 obj_24 obj_09)
       (pred_4 obj_24 obj_26)
       (pred_4 obj_31 obj_28)
       (pred_4 obj_31 obj_20)
       (pred_4 obj_31 obj_24)
       (pred_4 obj_03 obj_23)
       (pred_4 obj_03 obj_05)
       (pred_4 obj_03 obj_08)
       (pred_4 obj_05 obj_19)
       (pred_4 obj_05 obj_18)
       (pred_4 obj_05 obj_21)
       (pred_4 obj_05 obj_03)
       (pred_4 obj_18 obj_04)
       (pred_4 obj_18 obj_22)
       (pred_4 obj_18 obj_26)
       (pred_4 obj_18 obj_05)
       (pred_4 obj_22 obj_15)
       (pred_4 obj_22 obj_28)
       (pred_4 obj_22 obj_24)
       (pred_4 obj_22 obj_18)
       (pred_4 obj_28 obj_02)
       (pred_4 obj_28 obj_31)
       (pred_4 obj_28 obj_22)
       (pred_4 obj_23 obj_19)
       (pred_4 obj_23 obj_03)
       (pred_4 obj_19 obj_04)
       (pred_4 obj_19 obj_05)
       (pred_4 obj_19 obj_23)
       (pred_4 obj_04 obj_15)
       (pred_4 obj_04 obj_18)
       (pred_4 obj_04 obj_19)
       (pred_4 obj_15 obj_02)
       (pred_4 obj_15 obj_22)
       (pred_4 obj_15 obj_04)
       (pred_4 obj_02 obj_28)
       (pred_4 obj_02 obj_15)
       (pred_2 obj_03)
       (pred_2 obj_09)
       (pred_2 obj_11)
       (pred_2 obj_15)
       (pred_3  obj_03 obj_13)
       (pred_3  obj_09 obj_16)
       (pred_3  obj_11 obj_06)
       (pred_3  obj_15 obj_06)
       (pred_10 obj_07)
       (pred_10 obj_14)
       (pred_10 obj_30)
       (pred_10 obj_12)
       (pred_10 obj_10)
       (pred_10 obj_27)
       (pred_10 obj_29)
       (pred_10 obj_20)
       (pred_10 obj_08)
       (pred_10 obj_21)
       (pred_10 obj_26)
       (pred_10 obj_24)
       (pred_10 obj_31)
       (pred_10 obj_05)
       (pred_10 obj_18)
       (pred_10 obj_22)
       (pred_10 obj_28)
       (pred_10 obj_23)
       (pred_10 obj_19)
       (pred_10 obj_04)
       (pred_10 obj_02)

       (pred_12  obj_32 obj_13)
       (pred_12  obj_25 obj_16)
       (pred_12  obj_17 obj_06)
       (pred_12  obj_01 obj_06)
       (pred_9 obj_32 obj_28)
       (pred_9 obj_25 obj_27)
       (pred_9 obj_17 obj_27)
       (pred_9 obj_01 obj_27)
       (pred_5 obj_24)
    )

    (:goal (and
       (pred_9 obj_32 obj_14)
       (pred_9 obj_01 obj_26)
    ))
(:constraints
  (always (not (pred_5 obj_29)))
)
)

; plan
1. (op_1 obj_24 obj_26)
   deleted: (pred_5 obj_24)
   added: (pred_5 obj_26)
   goals met: 0 of 2
2. (op_1 obj_26 obj_21)
   deleted: (pred_5 obj_26)
   added: (pred_5 obj_21)
   goals met: 0 of 2
3. (op_1 obj_21 obj_27)
   deleted: (pred_5 obj_21)
   added: (pred_5 obj_27)
   goals met: 0 of 2
4. (op_2 obj_27 obj_01)
   deleted: (pred_9 obj_01 obj_27) (pred_7)
   added: (pred_11 obj_01)
   goals met: 0 of 2
5. (op_1 obj_27 obj_21)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_21)
   goals met: 0 of 2
6. (op_1 obj_21 obj_26)
   deleted: (pred_5 obj_21)
   added: (pred_5 obj_26)
   goals met: 0 of 2
7. (op_1 obj_26 obj_24)
   deleted: (pred_5 obj_26)
   added: (pred_5 obj_24)
   goals met: 0 of 2
8. (op_1 obj_24 obj_31)
   deleted: (pred_5 obj_24)
   added: (pred_5 obj_31)
   goals met: 0 of 2
9. (op_4 obj_31 obj_01)
   deleted: (pred_11 obj_01)
   added: (pred_7) (pred_9 obj_01 obj_31)
   goals met: 0 of 2
10. (op_1 obj_31 obj_28)
   deleted: (pred_5 obj_31)
   added: (pred_5 obj_28)
   goals met: 0 of 2
11. (op_2 obj_28 obj_32)
   deleted: (pred_9 obj_32 obj_28) (pred_7)
   added: (pred_11 obj_32)
   goals met: 0 of 2
12. (op_1 obj_28 obj_31)
   deleted: (pred_5 obj_28)
   added: (pred_5 obj_31)
   goals met: 0 of 2
13. (op_3 obj_31 obj_01 obj_32)
   deleted: (pred_11 obj_32) (pred_9 obj_01 obj_31)
   added: (pred_11 obj_01) (pred_9 obj_32 obj_31)
   goals met: 0 of 2
14. (op_1 obj_31 obj_24)
   deleted: (pred_5 obj_31)
   added: (pred_5 obj_24)
   goals met: 0 of 2
15. (op_1 obj_24 obj_26)
   deleted: (pred_5 obj_24)
   added: (pred_5 obj_26)
   goals met: 0 of 2
16. (op_4 obj_26 obj_01)
   deleted: (pred_11 obj_01)
   added: (pred_7) (pred_9 obj_01 obj_26)
   goals met: 1 of 2
17. (op_1 obj_26 obj_24)
   deleted: (pred_5 obj_26)
   added: (pred_5 obj_24)
   goals met: 1 of 2
18. (op_1 obj_24 obj_31)
   deleted: (pred_5 obj_24)
   added: (pred_5 obj_31)
   goals met: 1 of 2
19. (op_2 obj_31 obj_32)
   deleted: (pred_9 obj_32 obj_31) (pred_7)
   added: (pred_11 obj_32)
   goals met: 1 of 2
20. (op_1 obj_31 obj_20)
   deleted: (pred_5 obj_31)
   added: (pred_5 obj_20)
   goals met: 1 of 2
21. (op_1 obj_20 obj_12)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_12)
   goals met: 1 of 2
22. (op_1 obj_12 obj_30)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_30)
   goals met: 1 of 2
23. (op_1 obj_30 obj_14)
   deleted: (pred_5 obj_30)
   added: (pred_5 obj_14)
   goals met: 1 of 2
24. (op_4 obj_14 obj_32)
   deleted: (pred_11 obj_32)
   added: (pred_7) (pred_9 obj_32 obj_14)
   goals met: 2 of 2
